rupeshwandhare/InductionMotor_F28004x/vienna_main.c
//#############################################################################
//
// FILE:   vienna_main.c
//
// TITLE: This is the main file for the solution, following is the
//         <solution>.c -> solution source file
//         <solution>.h -> solution header file
//         <solution>_settings.h -> powerSUITE generated settings
//         <solution>_hal.c -> solution hardware abstraction layer
//         <solution>_hal.h -> solution hardware abstraction layer header file
//         <solution>_clatask.cla -> cla task file
//
//#############################################################################
// $TI Release: TIDM_1000 v4.01.01.00 $
// $Release Date: Tue Nov  3 10:37:49 CST 2020 $
// $Copyright:
// Copyright (C) 2020 Texas Instruments Incorporated - http://www.ti.com/
//
// ALL RIGHTS RESERVED
// $
//#############################################################################

// the includes
//
#include "F28x_Project.h"
#include "device.h"
#include "driverlib.h"
#include "vienna.h"
#define MATH_TYPE FLOAT_MATH
#include "IQmathLib.h"
#include "CLAmath.h"

//
// Include Flash API include file
//
#include "F021_F28004x_C28x.h"

//
// Include Flash API example header file
//
#include "flash_programming_f28004x.h"


//
//---  State Machine Related ---
//
/*
int16_t vTimer0[4];         // Virtual Timers slaved off CPU Timers (A events)
int16_t vTimer1[4];         // Virtual Timers slaved off CPU Timers (B events)
*/

//
// Variable declarations for state machine
//
void (*Alpha_State_Ptr)(void);  // Base States pointer
void (*A_Task_Ptr)(void);       // State pointer A branch
void (*B_Task_Ptr)(void);       // State pointer B branch
void (*C_Task_Ptr)(void);       // State pointer C branch

//
// State Machine function prototypes
//------------------------------------
// Alpha states
//
void A0(void);  //state A0
void B0(void);  //state B0

//
// A branch states
//
void A1(void);  //state A1
void A2(void);  //state A2

//
// B branch states
//
void B1(void);  //state B1
void B2(void);  //state B2
void B3(void);  //state B3

//=====
//
// Globals
//
Uint32  ECap1IntCount;
Uint32  ECap1PassCount;
Uint32  EPwm3TimerDirection;

// Globals
//
uint32_t ecap1IntCount;
uint32_t ecap1PassCount;
uint32_t epwm3TimerDirection;
volatile uint16_t cap2Count;
volatile uint16_t cap3Count;
volatile uint16_t cap4Count;
volatile uint16_t epwm3PeriodCount;

//void setupPWM1(uint32_t base1, uint32_t base2, uint32_t base3, uint16_t pwm_period_ticks);
//void configurePWMUpDwnCnt1(uint32_t base1, uint16_t pwm_period_ticks);

//
// Function Prototypes
//

__interrupt void ecap1_isr(void);
void InitECapture(void);
void InitEPwmTimer(void);
void Fail(void);
void initECAP(void);
__interrupt void ecap1ISR(void);
Uint16 flag_start_remote = 0;
Uint16 packet_remote = 0;
unsigned long Switch=0;
unsigned long Last_Switch, Prev_Switch;
Uint16 Longpress=0;
#define UP_Key          0x00FF6996//0x01FE58A7             // Increment Key-code
#define DOWN_Key        0x00FFA956//0x01FEA05F             // Decrement Key-code
#define RIGHT_Key       0x00FFC936//0x01FEC03F
#define LEFT_Key        0x00FF49B6//0x01FE807F
#define MODE_Key        0x00FF9966//0x01FE40BF
#define OnOff_Key       0x00FF59A6

void remote_operation(void);
void ISR_remote(void);
void remote_key_display_state_machine(void);

//LCD1602
void CursorON(void);                              /* Make Cursor visible */
void CursorOFF(void);                             /* Hide cursor */
void DisplayLCD(char LineNumber,char *Message);   /* Display the given message (16 characters) at given location on LCD */
void WriteCommandLCD(unsigned char CommandByte);  /* Write the given command to LCD */
void WriteDataLCD(unsigned char DataByte);        /* Write the given data to LCD */
void InitializeLCD(void);                         /* Initialize LCD */
void LCDDelay(void);
void LCDDelay1600(void);
void SendByte(unsigned char Value);

/*
#define D0      GpioDataRegs.GPASET.bit.GPIO0
#define D0Not   GpioDataRegs.GPACLEAR.bit.GPIO0
#define D1      GpioDataRegs.GPASET.bit.GPIO1
#define D1Not   GpioDataRegs.GPACLEAR.bit.GPIO1
#define D2      GpioDataRegs.GPASET.bit.GPIO2
#define D2Not   GpioDataRegs.GPACLEAR.bit.GPIO2
#define D3      GpioDataRegs.GPASET.bit.GPIO3
#define D3Not   GpioDataRegs.GPACLEAR.bit.GPIO3
*/
#define D4      GpioDataRegs.GPBSET.bit.GPIO34
#define D4Not   GpioDataRegs.GPBCLEAR.bit.GPIO34
#define D5      GpioDataRegs.GPBSET.bit.GPIO35
#define D5Not   GpioDataRegs.GPBCLEAR.bit.GPIO35
#define D6      GpioDataRegs.GPBSET.bit.GPIO37
#define D6Not   GpioDataRegs.GPBCLEAR.bit.GPIO37
#define D7      GpioDataRegs.GPBSET.bit.GPIO39
#define D7Not   GpioDataRegs.GPBCLEAR.bit.GPIO39
#define E       GpioDataRegs.GPBSET.bit.GPIO33
#define ENot    GpioDataRegs.GPBCLEAR.bit.GPIO33
#define RS      GpioDataRegs.GPBSET.bit.GPIO32
#define RSNot   GpioDataRegs.GPBCLEAR.bit.GPIO32


void LCD_selection(void);
void Command_Process(void);
void Array_Process(void);
void Byte_Process(void);
void MSNibble_Process(void);
void LSNibble_Process(void);
void (*LCD_Ptr)(void);
void Lcd_Nibble_Port(unsigned char Value);
char LSNibble, MSNibble;
char char_LCD;
Uint16 i_LCD=0;
Uint16 j_LCD=0;
enum LCD_STATE {LCD_NO_ACTION=0, SCREEN1R1, SCREEN1R2, SCREEN2R1, SCREEN2R2, SCREEN3R1, SCREEN3R2, SCREEN4R1, SCREEN4R2, SCREEN5R1, SCREEN5R2, SCREEN6R1, SCREEN6R2, SCREEN7R1, SCREEN7R2, SCREEN8R1, SCREEN8R2, SCREEN9R1, SCREEN9R2, CLEAR_SCREEN, LINE1, LINE2, CURSOR_ON, CURSOR_OFF, SHIFT_RIGHT, SHIFT_LEFT};
char *string_LCD;
char command_LCD;
Uint16 LCD_ACTION = 0;
Uint16 New_string=0;
Uint16 New_command=0;

char screen1r1text[] =      "Ch1=   ;Vdc=   V";
char screen1r2text[] =      "V1=   V;I1=  . A";

char screen2r1text[] =      "Ch2=   ;Vdc=   V";
char screen2r2text[] =      "V2=   V;I2=  . A";

char screen3r1text[] =      "Ir1=  . ;Vr1=   ";
char screen3r2text[] =      "IL1=  . ;Vp1=   ";

char screen4r1text[] =      "Ir2=  . ;Vr2=   ";
char screen4r2text[] =      "IL2=  . ;Vp2=   ";

char screen5r1text[] =      "BoardTemp=  . C ";
char screen5r2text[] =      "Vdc=   V;Vc= .  ";

char screen6r1text[] =      "Dt1=  . %POT=  %";
char screen6r2text[] =      "Dt2=  . %       ";

char screen7r1text[] =      "To Change Para: ";
char screen7r2text[] =      "PsW:            ";

char screen8r1text[] =      "Index:     ;Md= ";
char screen8r2text[] =      "Val=            ";

char screen9r1text[] =      "Fault:          ";
char screen9r2text[] =      "Fixed it?       ";

uint16_t Screen_count=1;
Uint16 UpDownKeyFunc=1;
Uint16 Test3=0;
enum UPDOWNFUNC {KeyForScreenMov=0, KeyForPasswordConst, KeyForChangeIDofConst, KeyForChangeofConst};

Uint16 Command_Const=0;
Uint16 Command_PwD=0;

Uint16 PasswordConst = 0;

