rupeshwandhare/InductionMotor_F28004x/vienna_main.c
float Dis_Constant;
Uint16 ID_Const=0;
float Constant=0.0;
volatile float32_t *Ptr_Constant;

unsigned int x_int, x_deca, x_hecto, x_kelo, x_10kelo, x_100kelo, x_mega, x_10mega;

void StateControl_RemoteScreen(void);

float Pot_percent, Duty_percent;

struct COMMON_FLAG {
    uint16_t clearTrip:1;
};
#define COMMON_FLAG_DEFAULTS {0}

//
struct COMMAND {
    uint16_t OnOffCh1;
    uint16_t OnOffCh2;
    uint16_t Clear_OCfault;
};
#define COMMAND_DEFAULTS {0,0,0}

struct COMMAND command=COMMAND_DEFAULTS;


#define PowerRelay  GpioDataRegs.GPADAT.bit.GPIO14
#define DisablePWM  GpioDataRegs.GPADAT.bit.GPIO22
#define ExtSwitch   GpioDataRegs.GPBDAT.bit.GPIO30
#define LEDRed      GpioDataRegs.GPADAT.bit.GPIO15
//#define TimeTest    GpioDataRegs.GPBDAT.bit.GPIO26
#define TimeTest    GpioDataRegs.GPASET.bit.GPIO26
#define TimeTestN   GpioDataRegs.GPACLEAR.bit.GPIO26
//#define TimeTestToggle GpioDataRegs.GPATOGGLE.bit.GPIO26;

uint16_t CLA1mathTablesRunStart, CLA1mathTablesLoadStart;
uint16_t CLA1mathTablesLoadSize;
void configCLAMemory(void);
//=====
// Defines
void pickup_constant(void);
long int Decimizer[]={1,    1,  1,  10, 1,  100,    1,  1,  100,    1,  100000, 100,    1,  1,  100,    1,  1,  100,    10, 1,  100000, 100,    10, 10, 1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1000000,    1,  100,    1000000,    1,  100,    1,  1000000,    1,  1000,   1000,   1000,   1000,   1,  1,  1,  1,  100,    100,    100,    100,    10000,  10000,  10000,  10000,  10, 10, 10, 10, 10, 10, 100000, 10000000,   1};
#define NosOfConst 73
float32_t Constants_Default[]={0,   0,  0,  0,  30, 0.4,    2,  8,  9.04,   2,  0.0001, 0.5,    0,  30, 0.4,    2,  8,  9.04,   0,  2,  0.0001, 0.5,    25, -25,    0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0.00002,    112,    0.2,    0.00002,    112,    0.2,    500,    0.00002,    0,  31.44,  31.39,  31.44,  31.39,  100,    -100,   100,    -100,   0.7,    0.01,   0.7,    0.01,   0.2364, 0.2349, 0.2364, 0.2349, 25, -25,    25, -25,    25, -25,    0.99373,    0.0031317,  0};
#define  WORDS_IN_FLASH_BUFFER   NosOfConst*2 //70*2 for float variable; // Length (in 16-bit words) of data buffer used for program
//Data Buffers used for program operation using the flash API program function
#pragma  DATA_SECTION(Buffer,"DataBufferSection");
//uint16   Buffer[WORDS_IN_FLASH_BUFFER + 1];
float32_t   Buffer[NosOfConst + 1];
uint32   *Buffer32 = (uint32 *)Buffer;
//float32_t Read_Buffer[WORDS_IN_FLASH_BUFFER + 1];
float32_t *Ptr_flash_constants;
int idx;
uint16_t HMI_Change_Constants=0;
void load_flash_constants(void);
// Prototype of the functions used in this example
void Example_Error(Fapi_StatusType status);
void Example_Done(void);
void Write_to_Flash(void);//void Example_CallFlashAPI(void);
void FMSTAT_Fail(void);
void fill_buffer_forflashwrite(void);
Uint16 errorcheck=0;
//=====

//variable for UID of the device In global variable initialization
#define device_uid_address 0x000703CC   //for F280049 UID address is  0x000703CC and 0x000703CD and long int pick up both 16bit LSB and 16bit MSB together from 0x000703CC+0x000703CD
long int *Ptr_voltage_plus;     //This is actual pointer to uid
long int voltage_plus =0;       //This will get actual uid after mathematical manipulation
long int uid_dum;               //It is dummy variable to confuse


void main(void)
{
    //
    // This routine sets up the basic device configuration such as
    // initializing PLL, copying code from FLASH to RAM,
    // this routine will also initialize the CPU timers that are used in
    // the background 1, 2 & 3) task for this system (CPU time)
    //

    VIENNA_HAL_setupDevice();

    configCLAMemory();
    //======
    EALLOW;
    //PowerRelay
    GpioCtrlRegs.GPAMUX1.bit.GPIO14 = 0;
    GpioCtrlRegs.GPADIR.bit.GPIO14 = 1;
    //DisablePWM
    GpioCtrlRegs.GPAAMSEL.bit.GPIO22 = 0;//For GPIO22 and GPIO23 we need to manualy config them from analog to digital mode
    GpioCtrlRegs.GPAMUX2.bit.GPIO22 = 0;
    GpioCtrlRegs.GPADIR.bit.GPIO22 = 1;
    EDIS;

#if VIENNA_CONTROL_RUNNING_ON == CLA_CORE
    GPIO_setMasterCore(14, GPIO_CORE_CPU1_CLA1);
    GPIO_setMasterCore(22, GPIO_CORE_CPU1_CLA1);
//    GPIO_setMasterCore(26, GPIO_CORE_CPU1_CLA1); //defined after new lines down
#endif

    EALLOW;
    //LEDRed
    GpioCtrlRegs.GPAMUX1.bit.GPIO15 = 0;
    GpioCtrlRegs.GPADIR.bit.GPIO15 = 1;
    //ExtSwitch
    GpioCtrlRegs.GPAMUX2.bit.GPIO30 = 0;
    GpioCtrlRegs.GPAQSEL2.bit.GPIO30 = 2; //6sample qualification
    GpioCtrlRegs.GPADIR.bit.GPIO30 = 0;
    EDIS;

    GpioDataRegs.GPADAT.bit.GPIO14 = 0;
    GpioDataRegs.GPADAT.bit.GPIO15 = 0;
    GpioDataRegs.GPADAT.bit.GPIO22 = 1;

    EALLOW;
    //TestPin shared with I2C
    GpioCtrlRegs.GPAMUX2.bit.GPIO26 = 0;
    GpioCtrlRegs.GPADIR.bit.GPIO26 = 1;
    EDIS;
//    GpioDataRegs.GPACLEAR.bit.GPIO26 = 1;
    //=====

#if VIENNA_CONTROL_RUNNING_ON == CLA_CORE
    GPIO_setMasterCore(26, GPIO_CORE_CPU1_CLA1);
#endif
    GpioDataRegs.GPADAT.bit.GPIO26 = 1;
    //
    // Tasks State-machine init
    //
    Alpha_State_Ptr = &A0;
    A_Task_Ptr = &A1;
    B_Task_Ptr = &B1;

    //
    // Stop all PWM mode clock
    //
    VIENNA_HAL_disablePWMClkCounting();

    //
    //sets up the PWMs for the VIENNA PFC
    //
//    VIENNA_HAL_setupPWM(VIENNA_HIGH_FREQ_PWM1_BASE, VIENNA_HIGH_FREQ_PWM2_BASE,  VIENNA_HIGH_FREQ_PWM3_BASE, VIENNA_PFC3PH_PWM_PERIOD);
    setupPWM(VIENNA_HIGH_FREQ_PWM1_BASE, VIENNA_HIGH_FREQ_PWM2_BASE, VIENNA_HIGH_FREQ_PWM3_BASE, VIENNA_PFC3PH_PWM_PERIOD, INV_DEADBAND_PWM_COUNT, INV_DEADBAND_PWM_COUNT);

    //
    // power up ADC on the device
    //
//    VIENNA_HAL_setupADC();
    setupADC();

    #if VIENNA_SDFM_SENSING == 1
        VIENNA_HAL_setupSDFM(VIENNA_PFC3PH_PWM_PERIOD,
                             VIENNA_PWM_CLK_IN_SDFM_OSR,
                             VIENNA_SD_CLK_COUNT, VIENNA_SDFM_OSR);
    #endif

    //
    //Profiling GPIO
    //
//    VIENNA_HAL_setupProfilingGPIO();

    //
    //configure LED GPIO
    //
//    VIENNA_HAL_setupLEDGPIO();

    //
    //initialize global variables
    //
//    VIENNA_globalVariablesInit();
    initGlobalVariable();
    //
    // Enable PWM Clocks
    //
    VIENNA_HAL_enablePWMClkCounting();

    //
    //setup PMW trigger for the ADC conversions
    //
    VIENNA_HAL_setupTriggerForADC(VIENNA_HIGH_FREQ_PWM1_BASE);   //same, checked

    #if VIENNA_SDFM_SENSING == 1
        VIENNA_HAL_enablePWMInterruptGeneration(
                                 VIENNA_C28x_ISR1_INTERRUPT_TRIG_PWM_BASE,
                                 (float32_t)VIENNA_PWM_CLK_IN_SDFM_OSR *
                                 (float32_t)1.5 );
    #else
        VIENNA_HAL_enablePWMInterruptGeneration(
                     VIENNA_C28x_ISR1_INTERRUPT_TRIG_PWM_BASE,
                     EPWM_getCounterCompareValue(VIENNA_HIGH_FREQ_PWM1_BASE,
                     EPWM_COUNTER_COMPARE_B) );
    #endif

    //
    // Offset Calibration Routine
    // #if VIENNA_SDFM_SENSING == 0
    //  VIENNA_calibrateOffset();
    // #endif
    //
    #if SENSING_OPTION == ADC_BASED_SENSING
        VIENNA_calibrateOffset();
    #endif

    //
    // setup protection and trips for the board
    //
    VIENNA_HAL_setupBoardProtection(VIENNA_HIGH_FREQ_PWM1_BASE,
                                    VIENNA_HIGH_FREQ_PWM2_BASE,
                                    VIENNA_HIGH_FREQ_PWM3_BASE,
                                    VIENNA_I_TRIP_LIMIT_AMPS, VIENNA_I_MAX_SENSE_AMPS);

    //InitECap1Gpio(16);
    {
        EALLOW;
        InputXbarRegs.INPUT7SELECT = 16;         // Set eCAP1 source to GPIO-pin
        EDIS;
    }
    GPIO_SetupPinOptions(16, GPIO_INPUT, GPIO_ASYNC);

