rupeshwandhare/InductionMotor_F28004x/vienna_main.c
    //LCD I/O mapping
    EALLOW;
    GpioCtrlRegs.GPBMUX1.bit.GPIO34 = 0;
    GpioCtrlRegs.GPBMUX1.bit.GPIO35 = 0;
    GpioCtrlRegs.GPBMUX1.bit.GPIO37 = 0;
    GpioCtrlRegs.GPBMUX1.bit.GPIO39 = 0;
    GpioCtrlRegs.GPBMUX1.bit.GPIO33 = 0;
    GpioCtrlRegs.GPBMUX1.bit.GPIO32 = 0;

    GpioCtrlRegs.GPBDIR.bit.GPIO34 = 1;
    GpioCtrlRegs.GPBDIR.bit.GPIO35 = 1;
    GpioCtrlRegs.GPBDIR.bit.GPIO37 = 1;
    GpioCtrlRegs.GPBDIR.bit.GPIO39 = 1;
    GpioCtrlRegs.GPBDIR.bit.GPIO33 = 1;
    GpioCtrlRegs.GPBDIR.bit.GPIO32 = 1;
    EDIS;

    GpioDataRegs.GPBDAT.bit.GPIO34 = 0;
    GpioDataRegs.GPBDAT.bit.GPIO35 = 0;
    GpioDataRegs.GPBDAT.bit.GPIO37 = 0;
    GpioDataRegs.GPBDAT.bit.GPIO39 = 0;
    GpioDataRegs.GPBDAT.bit.GPIO33 = 0;
    GpioDataRegs.GPBDAT.bit.GPIO32 = 0;

    InitECapture();

 // Initialize counters:
    ECap1IntCount = 0;
    ECap1PassCount = 0;

    //for  UID of the device, CHECK WHETHER MOD IS POSSIBLE TO ADD IN EQUATION FOR ENHANCE SECURITY. In initialization code::
        Ptr_voltage_plus = (long int *)device_uid_address;  //uid address to pointer to variable
        voltage_plus = (*Ptr_voltage_plus)*3-17954;          //mathematical manipulation to actual uid
        if (uid_dum==1081804){};                            //Dummy instruction
//        for (;voltage_plus!=3227458;){}                     //Actual check after mathematical manipulation


    InitializeLCD();
    LCD_Ptr = &LCD_selection;

    //
    // PWM were tripped low in the previous routine
    // safe to setup PWM pins
    //
    VIENNA_HAL_setPinsAsPWM();


    //Load Flash Constants
    load_flash_constants();

    //
    // ISR Mapping
    //
    VIENNA_HAL_setupInterrupt();

    //
    // Setup SFRA
    //
//    VIENNA_setupSFRA();

    //
    // IDLE loop. Just sit and loop forever, periodically will branch into
    // A0-A3, B0-B3, C0-C3 tasks
    // Frequency of this branching is set in setupDevice routine:
    //

    LCD_ACTION = CLEAR_SCREEN;
    UpDownKeyFunc=KeyForScreenMov;
    CONTROL_STATE = VDC_CHARGING;

    //First time flash writing after flash erase
    if (*(uint32_t*)Bzero_Sector6_start) {
//        errorcheck=*(uint32_t*)Bzero_Sector6_start;
        Load_Default_Constants=1;
        fill_buffer_forflashwrite();
//        errorcheck=*(uint32_t*)Bzero_Sector6_start;
    }

    //Load constants from flash memory
    load_flash_constants();

    for(;;)
    {
        //
        // State machine entry & exit point
        //
        (*Alpha_State_Ptr)();   // jump to an Alpha state (A0,B0,...)

    }
} //END MAIN CODE

//
// ISRs are named by the priority
// ISR1 is the highest priority
// ISR2 has the next highest and so forth
//

//
// control ISR Code
//
#if VIENNA_CONTROL_RUNNING_ON == C28x_CORE
    interrupt void ISR1(void)
    {
        ControlCode_PVEmu();
        //VIENNA_pfcControlCode();
        VIENNA_HAL_clearInterrupt(VIENNA_C28x_ISR1_INTERRUPT_PIE_GROUP_NO);
    }// control ISR Ends Here
#endif

//
// 10Khz ISR Code
//
#if VIENNA_INSTRUMENTATION_ISR_RUNNING_ON == C28x_CORE
    interrupt void ISR2(void)
    {
        protections();
//        VIENNA_instrumentationCode();
     }// 10Khz ISR Ends Here
#endif

//
//=============================================================================
//  STATE-MACHINE SEQUENCING AND SYNCRONIZATION FOR SLOW BACKGROUND TASKS
//=============================================================================
//
//
//--------------------------------- FRAME WORK --------------------------------
//
void A0(void)
{
    //
    // loop rate synchronizer for A-tasks
    //
    if(VIENNA_TASKA_CTR_OVFLW_STATUS == 1)
    {
        VIENNA_CLEAR_TASKA_CTR_OVFLW_FLAG;    // clear flag

        //
        // jump to an A Task (A1,A2,A3,...)
        //
        (*A_Task_Ptr)();

//        vTimer0[0]++;           // virtual timer 0, instance 0 (spare)
    }
    Alpha_State_Ptr = &B0;      // Comment out to allow only A tasks
}

void B0(void)
{
    //
    // loop rate synchronizer for B-tasks
    //
    if(VIENNA_TASKB_CTR_OVFLW_STATUS  == 1)
    {
        VIENNA_CLEAR_TASKB_CTR_OVFLW_FLAG;                  // clear flag

        //
        // jump to a B Task (B1,B2,B3,...)
        //
        (*B_Task_Ptr)();

//        vTimer1[0]++;           // virtual timer 1, instance 0 (spare)
    }

    //
    // Allow A state tasks
    //
    Alpha_State_Ptr = &A0;
}

//
//=============================================================================
//  A - TASKS (executed in every 1 msec)
//=============================================================================
//

void A1(void)
{
    remote_operation();
//    GpioDataRegs.GPATOGGLE.bit.GPIO26 = 1;
    //    VIENNA_runSFRABackGroundTasks();
    //
    //the next time CpuTimer0 'counter' reaches Period value go to A1
    //
    A_Task_Ptr = &A2;
}

void A2(void)
{
//    protections4();
    //
    //the next time CpuTimer0 'counter' reaches Period value go to A1
    //
    A_Task_Ptr = &A1;
}

//
//=============================================================================
//  B - TASKS (executed in every 5 msec)
//=============================================================================
//

void B1(void)
{

    (*LCD_Ptr)();  ////in 1 millisencond subroutine

    if (LCD_ACTION==LCD_NO_ACTION) {
        StateControl_RemoteScreen();
    }
//    VIENNA_updateBoardStatus();

    //
    //the next time CpuTimer1 'counter' reaches Period value go to B2
    //
    B_Task_Ptr = &B2;
}

void B2(void)
{
    remote_key_display_state_machine();

    //    VIENNA_HAL_toggleLED();

    //
    //the next time CpuTimer1 'counter' reaches Period value go to B1
    //
    B_Task_Ptr = &B3;

}
Uint16 i=0;
void B3(void)
{
//    setTimeCheck();
    if (common_flag_init_GlobalVariable) {
        initGlobalVariable();
    }

    i++;
    if (i>667) {    //for 1sec
        i=0;

        if ( ECap1Regs.TSCTR > 0x007FFFFF) {    //reset ecap counter for IR remote
            ECap1Regs.TSCTR =0;
            ECAP_reArm(ECAP1_BASE); //ECAP_ECCTL2_REARM;
        }

        if(LEDRed) LEDRed=OFF;

