rupeshwandhare/InductionMotor_F28004x/vienna_main.c
        if (HMI_Change_Constants){
            if (command_OnOffCh1==OFF && command_OnOffCh2==OFF && UpDownKeyFunc!=KeyForChangeofConst && UpDownKeyFunc!=KeyForChangeIDofConst){
                fill_buffer_forflashwrite();
            }
        }
    }

    //    VIENNA_HAL_toggleLED();

    //
    //the next time CpuTimer1 'counter' reaches Period value go to B1
    //
    B_Task_Ptr = &B1;
//    resetTimeCheck();
}

/* Initializes LCD */
void InitializeLCD(void)
{
    E = SET; //GPIO_setHigh(myGpio, E);

    LCDDelay1600();
    LCDDelay1600();
    LCDDelay1600();
    LCDDelay1600();

    WriteCommandLCD(0x03);          //Command to select 4 bit interface
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay

    LCDDelay1600();
    LCDDelay1600();
    LCDDelay1600();


    WriteCommandLCD(0x03);          //Command to select 4 bit interface
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay

    WriteCommandLCD(0x03);          //Command to select 4 bit interface
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay
    LCDDelay();
    WriteCommandLCD(0x02);          //Command to select 4 bit interface
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay
    LCDDelay1600();


    WriteCommandLCD(0x02);          //Command to
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay
    WriteCommandLCD(0x08);          //Command to off cursor,display off
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay

    WriteCommandLCD(0x00);          //Command to
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay
    WriteCommandLCD(0x0C);          //Command to
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay

    LCDDelay1600();
    WriteCommandLCD(0x00);          //Command to
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay
    WriteCommandLCD(0x06);          //Command for setting entry mode
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay

    WriteCommandLCD(0x0f);          //Command to on cursor,blink cursor
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay
    WriteCommandLCD(0x02);          //Command return the cursor to home
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
    ENot = SET;
    LCDDelay();                         //Small delay
    LCDDelay();                     //Small delay

    LCDDelay1600();
}

void LCD_selection(void)
{
   switch (LCD_ACTION) {    //keep LCD_ACTION can have only one value
       case LCD_NO_ACTION:
           break;
       case SCREEN1R1:
           //char screen1r1text[] =      "Ch1=   ;Vdc=   V";

/*
           if(PowerControl_State_Ptr1 == &Vpv_Control1) {
               screen1r1text[4] = "O";
               screen1r1text[5] = "n";
               screen1r1text[6] = " ";
           } else if(PowerControl_State_Ptr1 == &Idle_State1) {
               screen1r1text[4] = "O";
               screen1r1text[5] = "f";
               screen1r1text[6] = "f";
           } else if(PowerControl_State_Ptr1 == &Slew_Control1) {
               screen1r1text[4] = "A";
               screen1r1text[5] = "c";
               screen1r1text[6] = "c";
           } else if(PowerControl_State_Ptr1 == &Fault_State) {
               screen1r1text[4] = "F";
               screen1r1text[5] = "l";
               screen1r1text[6] = "t";
           } else if(PowerControl_State_Ptr1 == &Vdc_Charging) {
               screen1r1text[4] = "C";
               screen1r1text[5] = "h";
               screen1r1text[6] = "g";
           }
*/

           if(CONTROL_STATE == VPV_CONTROL1) {
               screen1r1text[4] = 'O';
               screen1r1text[5] = 'n';
               screen1r1text[6] = ' ';
           } else if(CONTROL_STATE == IDLE_STATE1) {
               screen1r1text[4] = 'O';
               screen1r1text[5] = 'f';
               screen1r1text[6] = 'f';
           } else if(CONTROL_STATE == SLEW_CONTROL1) {
               screen1r1text[4] = 'A';
               screen1r1text[5] = 'c';
               screen1r1text[6] = 'c';
           } else if(CONTROL_STATE == FAULT_STATE) {
               screen1r1text[4] = 'F';
               screen1r1text[5] = 'l';
               screen1r1text[6] = 't';
           } else if(CONTROL_STATE == VDC_CHARGING) {
               screen1r1text[4] = 'C';
               screen1r1text[5] = 'h';
               screen1r1text[6] = 'g';
           } else if(CONTROL_STATE == DEACCELERATION1) {
               screen1r1text[4] = 'D';
               screen1r1text[5] = 'c';
               screen1r1text[6] = 'c';
           }

