rupeshwandhare/InductionMotor_F28004x/vienna_main.c
//           va = 23.1;
           x_hecto = (unsigned int)(VIENNA_vDCMeas_pu*0.01);
           x_deca = (unsigned int)((float)(VIENNA_vDCMeas_pu - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)VIENNA_vDCMeas_pu - (float)(x_hecto*100) - (float)(x_deca*10));
           screen1r1text[12] = (x_hecto+'0');
           screen1r1text[13] = (x_deca+'0');
           screen1r1text[14] = (x_int+'0');

           string_LCD = screen1r1text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN1R2:
           //char screen1r2text[] =      "V1=   V;I1=  . A";

           x_hecto = (unsigned int)(sensor_v_pv1_fltr*0.01);
           x_deca = (unsigned int)((float)(sensor_v_pv1_fltr - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)sensor_v_pv1_fltr - (float)(x_hecto*100) - (float)(x_deca*10));
           screen1r2text[3] = (x_hecto+'0');
           screen1r2text[4] = (x_deca+'0');
           screen1r2text[5] = (x_int+'0');

//           ia = 5.2;
           x_hecto = (unsigned int)(sensor_i_pv1_fltr*0.1);
           x_deca = (unsigned int)((float)(sensor_i_pv1_fltr - x_hecto*10));
           x_int = (unsigned int) (float)(sensor_i_pv1_fltr*10 - (float)(x_hecto*100) - (float)(x_deca*10));
           screen1r2text[11] = (x_hecto+'0');
           screen1r2text[12] = (x_deca+'0');
           screen1r2text[14] = (x_int+'0');

           string_LCD = screen1r2text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN2R1:
           //char screen2r1text[] =      "Ch2=   ;Vdc=   V";

/*
           if(PowerControl_State_Ptr2 = &Vpv_Control2) {
               screen1r1text[4] = "O";
               screen1r1text[5] = "n";
               screen1r1text[6] = " ";
           } else if(PowerControl_State_Ptr2 = &Idle_State2) {
               screen1r1text[4] = "O";
               screen1r1text[5] = "f";
               screen1r1text[6] = "f";
           }
           } else if(PowerControl_State_Ptr2 = &Slew_Control2) {
               screen1r1text[4] = "A";
               screen1r1text[5] = "c";
               screen1r1text[6] = "c";
           } else if(PowerControl_State_Ptr2 = &Fault_State) {
               screen1r1text[4] = "F";
               screen1r1text[5] = "l";
               screen1r1text[6] = "t";
           } else if(PowerControl_State_Ptr2 = &Vdc_Charging) {
               screen1r1text[4] = "C";
               screen1r1text[5] = "h";
               screen1r1text[6] = "g";
           }
*/

           if(CONTROL_STATE2 == VPV_CONTROL2) {
               screen2r1text[4] = 'O';
               screen2r1text[5] = 'n';
               screen2r1text[6] = ' ';
           } else if(CONTROL_STATE2 == IDLE_STATE2) {
               screen2r1text[4] = 'O';
               screen2r1text[5] = 'f';
               screen2r1text[6] = 'f';
           } else if(CONTROL_STATE2 == SLEW_CONTROL2) {
               screen2r1text[4] = 'A';
               screen2r1text[5] = 'c';
               screen2r1text[6] = 'c';
           } else if(CONTROL_STATE2 == FAULT_STATE) {
               screen2r1text[4] = 'F';
               screen2r1text[5] = 'l';
               screen2r1text[6] = 't';
           } else if(CONTROL_STATE2 == VDC_CHARGING) {
               screen2r1text[4] = 'C';
               screen2r1text[5] = 'h';
               screen2r1text[6] = 'g';
           } else if(CONTROL_STATE2 == DEACCELERATION2) {
               screen2r1text[4] = 'D';
               screen2r1text[5] = 'c';
               screen2r1text[6] = 'c';
           }

//           va = 23.1;
           x_hecto = (unsigned int)(VIENNA_vDCMeas_pu*0.01);
           x_deca = (unsigned int)((float)(VIENNA_vDCMeas_pu - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)VIENNA_vDCMeas_pu - (float)(x_hecto*100) - (float)(x_deca*10));
           screen2r1text[12] = (x_hecto+'0');
           screen2r1text[13] = (x_deca+'0');
           screen2r1text[14] = (x_int+'0');

           string_LCD = screen2r1text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN2R2:
           //char screen2r2text[] =      "V2=   V;I2=  . A";
//           va = 231;
           x_hecto = (unsigned int)(sensor_v_pv2_fltr*0.01);
           x_deca = (unsigned int)((float)(sensor_v_pv2_fltr - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)sensor_v_pv2_fltr - (float)(x_hecto*100) - (float)(x_deca*10));
           screen2r2text[3] = (x_hecto+'0');
           screen2r2text[4] = (x_deca+'0');
           screen2r2text[5] = (x_int+'0');

//           ia = 75.2;
           x_hecto = (unsigned int)(sensor_i_pv2_fltr*0.1);
           x_deca = (unsigned int)((float)(sensor_i_pv2_fltr - x_hecto*10));
           x_int = (unsigned int) (float)(sensor_i_pv2_fltr*10 - (float)(x_hecto*100) - (float)(x_deca*10));
           screen2r2text[11] = (x_hecto+'0');
           screen2r2text[12] = (x_deca+'0');
           screen2r2text[14] = (x_int+'0');

           string_LCD = screen2r2text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN3R1:
           //char screen3r1text[] =      "Ir1=  . ;Vr1=   ";
           x_hecto = (unsigned int)(il1_control_ref*0.1);
           x_deca = (unsigned int)((float)(il1_control_ref - x_hecto*10));
           x_int = (unsigned int) (float)(il1_control_ref*10 - (float)(x_hecto*100) - (float)(x_deca*10));
           screen3r1text[4] = (x_hecto+'0');
           screen3r1text[5] = (x_deca+'0');
           screen3r1text[7] = (x_int+'0');

           x_hecto = (unsigned int)(vpv1_control_ref*0.01);
           x_deca = (unsigned int)((float)(vpv1_control_ref - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)vpv1_control_ref - (float)(x_hecto*100) - (float)(x_deca*10));
           screen3r1text[13] = (x_hecto+'0');
           screen3r1text[14] = (x_deca+'0');
           screen3r1text[15] = (x_int+'0');

