rupeshwandhare/InductionMotor_F28004x/vienna_main.c
           string_LCD = screen3r1text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN3R2:
           //char screen3r2text[] =      "IL1=  . ;Vp1=   ";
           x_hecto = (unsigned int)(VIENNA_iL1Meas_pu*0.1);
           x_deca = (unsigned int)((float)(VIENNA_iL1Meas_pu - x_hecto*10));
           x_int = (unsigned int) (float)(VIENNA_iL1Meas_pu*10 - (float)(x_hecto*100) - (float)(x_deca*10));
           screen3r2text[4] = (x_hecto+'0');
           screen3r2text[5] = (x_deca+'0');
           screen3r2text[7] = (x_int+'0');

           x_hecto = (unsigned int)(VIENNA_vPV1Meas_pu*0.01);
           x_deca = (unsigned int)((float)(VIENNA_vPV1Meas_pu - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)VIENNA_vPV1Meas_pu - (float)(x_hecto*100) - (float)(x_deca*10));
           screen3r2text[13] = (x_hecto+'0');
           screen3r2text[14] = (x_deca+'0');
           screen3r2text[15] = (x_int+'0');

           string_LCD = screen3r2text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN4R1:
           //char screen4r1text[] =      "Ir2=  . ;Vr2=   ";
           x_hecto = (unsigned int)(il2_control_ref*0.1);
           x_deca = (unsigned int)((float)(il2_control_ref - x_hecto*10));
           x_int = (unsigned int) (float)(il2_control_ref*10 - (float)(x_hecto*100) - (float)(x_deca*10));
           screen4r1text[4] = (x_hecto+'0');
           screen4r1text[5] = (x_deca+'0');
           screen4r1text[7] = (x_int+'0');

           x_hecto = (unsigned int)(vpv2_control_ref*0.01);
           x_deca = (unsigned int)((float)(vpv2_control_ref - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)vpv2_control_ref - (float)(x_hecto*100) - (float)(x_deca*10));
           screen4r1text[13] = (x_hecto+'0');
           screen4r1text[14] = (x_deca+'0');
           screen4r1text[15] = (x_int+'0');

           string_LCD = screen4r1text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN4R2:
           //char screen4r2text[] =      "IL2=  . ;Vp2=   ";
           x_hecto = (unsigned int)(VIENNA_iL2Meas_pu*0.1);
           x_deca = (unsigned int)((float)(VIENNA_iL2Meas_pu - x_hecto*10));
           x_int = (unsigned int) (float)(VIENNA_iL2Meas_pu*10 - (float)(x_hecto*100) - (float)(x_deca*10));
           screen4r2text[4] = (x_hecto+'0');
           screen4r2text[5] = (x_deca+'0');
           screen4r2text[7] = (x_int+'0');

           x_hecto = (unsigned int)(VIENNA_vPV2Meas_pu*0.01);
           x_deca = (unsigned int)((float)(VIENNA_vPV2Meas_pu - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)VIENNA_vPV2Meas_pu - (float)(x_hecto*100) - (float)(x_deca*10));
           screen4r2text[13] = (x_hecto+'0');
           screen4r2text[14] = (x_deca+'0');
           screen4r2text[15] = (x_int+'0');

           string_LCD = screen4r2text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN5R1:
           //char screen5r1text[] =      "BoardTemp=  . C ";
           x_hecto = (unsigned int)(VIENNA_TEMPMeas_pu*0.1);
           x_deca = (unsigned int)((float)((VIENNA_TEMPMeas_pu - x_hecto*10)));
           x_int = (unsigned int) (float)((VIENNA_TEMPMeas_pu*10 - (float)(x_hecto*100) - (float)(x_deca*10)));
           screen5r1text[10] = (x_hecto+'0');
           screen5r1text[11] = (x_deca+'0');
           screen5r1text[13] = (x_int+'0');

           string_LCD = screen5r1text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN5R2:
           //char screen5r2text[] =      "Vdc=   V;Vc= .  ";
           x_hecto = (unsigned int)(VIENNA_vDCMeas_pu*0.01);
           x_deca = (unsigned int)((float)(VIENNA_vDCMeas_pu - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)VIENNA_vDCMeas_pu - (float)(x_hecto*100) - (float)(x_deca*10));
           screen5r2text[4] = (x_hecto+'0');
           screen5r2text[5] = (x_deca+'0');
           screen5r2text[6] = (x_int+'0');

           x_hecto = (unsigned int)(VIENNA_vCCMeas_pu);
           x_deca = (unsigned int)((float)(VIENNA_vCCMeas_pu - (float)(x_hecto) )*10);
           x_int = (unsigned int) ((float)((VIENNA_vCCMeas_pu - (float)(x_hecto))*10 - (float)(x_deca))*10);
           screen5r2text[12] = (x_hecto+'0');
           screen5r2text[14] = (x_deca+'0');
           screen5r2text[15] = (x_int+'0');

           string_LCD = screen5r2text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;

       case SCREEN6R1:
           //char screen6r1text[] =      "Dt1=  . %POT=  %";

           Duty_percent=(common_vars_duty1-0.030)*100; //(2x2x0.15usec)/(1/fsw)  2 for updowncount and 2 for at front and at back; Even after this 1% error at 50kHz due to IC response time
           if (Duty_percent<0.0) Duty_percent=0.0;
           x_hecto = (unsigned int)(Duty_percent*0.1);
           x_deca = (unsigned int)((float)(Duty_percent - x_hecto*10));
           x_int = (unsigned int) (float)(Duty_percent*10 - (float)(x_hecto*100) - (float)(x_deca*10));
           screen6r1text[4] = (x_hecto+'0');
           screen6r1text[5] = (x_deca+'0');
           screen6r1text[7] = (x_int+'0');

           Pot_percent=VIENNA_POTMeas_pu*100;
           x_hecto = (unsigned int)(Pot_percent*0.01);
           x_deca = (unsigned int)((float)(Pot_percent - (float)(x_hecto*100))* 0.1);
           x_int = (unsigned int) ((float)Pot_percent - (float)(x_hecto*100) - (float)(x_deca*10));
//           screen6r1text[4] = (x_hecto+'0');
           screen6r1text[13] = (x_deca+'0');
           screen6r1text[14] = (x_int+'0');

           string_LCD = screen6r1text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN6R2:
           //char screen6r2text[] =      "Dt2=  . %       ";

           Duty_percent=(common_vars_duty2-0.030)*100; //(2x2x0.15usec)/(1/fsw)  2 for updowncount and 2 for at front and at back; Even after this 1% error at 50kHz due to IC response time
           if (Duty_percent<0.0) Duty_percent=0.0;
           x_hecto = (unsigned int)(Duty_percent*0.1);
           x_deca = (unsigned int)((float)(Duty_percent - x_hecto*10));
           x_int = (unsigned int) (float)(Duty_percent*10 - (float)(x_hecto*100) - (float)(x_deca*10));
           screen6r2text[4] = (x_hecto+'0');
           screen6r2text[5] = (x_deca+'0');
           screen6r2text[7] = (x_int+'0');

           string_LCD = screen6r2text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;

       case SCREEN7R1:
           //char screen7r1text[] =      "To Change Para: ";
           screen7r1text[15] = ( (unsigned int)(UpDownKeyFunc)  +'0');

           string_LCD = screen7r1text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN7R2:
           //char screen7r2text[] =      "PsW:            ";
           //PasswordConst = 1243;
           x_kelo = (unsigned int)((float)(PasswordConst*0.001));
           x_hecto = (unsigned int)((float)((float)PasswordConst - (float)(x_kelo*1000))* 0.01);
           x_deca = (unsigned int) ((float)((float)PasswordConst - (float)(x_kelo*1000) - (float)(x_hecto*100))*0.1);
           x_int =  (unsigned int) ((float)((float)PasswordConst - (float)(x_kelo*1000) - (float)(x_hecto*100) - (float)(x_deca*10)) );
           screen7r2text[4] = (x_kelo+'0');
           screen7r2text[5] = (x_hecto+'0');
           screen7r2text[6] = (x_deca+'0');
           screen7r2text[7] = (x_int+'0');


