rupeshwandhare/InductionMotor_F28004x/vienna_main.c
           string_LCD = screen7r2text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;

       case SCREEN8R1:
           //char screen8r1text[] =      "Index:     ;Md= ";
           x_deca = (unsigned int)(ID_Const*0.1);
           x_int = (unsigned int)(float)(ID_Const - (float)(x_deca*10));
           screen8r1text[6] = (x_deca+'0');
           screen8r1text[7] = (x_int+'0');

           screen8r1text[14] = ( (unsigned int)(UpDownKeyFunc)  +'0');

           string_LCD = screen8r1text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN8R2:
           //char screen8r2text[] =      "Val=            ";

           if (Constant<0.0) Dis_Constant=-Constant;
           else Dis_Constant=Constant;
           x_10mega = (unsigned int)((float)(Dis_Constant*0.0000001));
           x_mega = (unsigned int)((float)((float)Dis_Constant - (float)(x_10mega*10000000))* 0.000001);
           x_100kelo = (unsigned int) ((float)((float)Dis_Constant - (float)(x_10mega*10000000) - (float)(x_mega*1000000))*0.00001);
           x_10kelo = (unsigned int) ((float)((float)Dis_Constant - (float)(x_10mega*10000000) - (float)(x_mega*1000000) - (float)(x_100kelo*100000))*0.0001);
           x_kelo = (unsigned int) ((float)((float)Dis_Constant - (float)(x_10mega*10000000) - (float)(x_mega*1000000) - (float)(x_100kelo*100000)- (float)(x_10kelo*10000) )*0.001 );
           x_hecto = (unsigned int) ((float)((float)Dis_Constant - (float)(x_10mega*10000000) - (float)(x_mega*1000000) - (float)(x_100kelo*100000)- (float)(x_10kelo*10000) - (float)(x_kelo*1000) )*0.01 );
           x_deca = (unsigned int) ((float)((float)Dis_Constant - (float)(x_10mega*10000000) - (float)(x_mega*1000000) - (float)(x_100kelo*100000)- (float)(x_10kelo*10000) - (float)(x_kelo*1000) - (float)(x_hecto*100))*0.1 );
           x_int = (unsigned int) ((float)((float)Dis_Constant - (float)(x_10mega*10000000) - (float)(x_mega*1000000) - (float)(x_100kelo*100000)- (float)(x_10kelo*10000) - (float)(x_kelo*1000) - (float)(x_hecto*100) - (float)(x_deca*10)));


           screen8r2text[4] = (x_10mega+'0');
           screen8r2text[5] = (x_mega+'0');
           screen8r2text[6] = (x_100kelo+'0');
           screen8r2text[7] = (x_10kelo+'0');
           screen8r2text[8] = (x_kelo+'0');
           screen8r2text[9] = (x_hecto+'0');
           screen8r2text[10] = (x_deca+'0');
           screen8r2text[11] = (x_int+'0');

           string_LCD = screen8r2text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;


       case SCREEN9R1:
           //char screen9r1text[] =      "Fault:          ";

           if(VIENNA_boardStatus == boardStatus_Idle) {
               screen9r1text[6] = 'I';
               screen9r1text[7] = 'd';
               screen9r1text[8] = 'l';
               screen9r1text[9] = 'e';
           } else if(VIENNA_boardStatus == boardStatus_OverVoltageTrip) {
               screen9r1text[6] = 'O';
               screen9r1text[7] = 'V';
               screen9r1text[8] = 'D';
               screen9r1text[9] = 'C';
           } else if(VIENNA_boardStatus == vdc_undervoltage) {
               screen9r1text[6] = 'U';
               screen9r1text[7] = 'V';
               screen9r1text[8] = 'D';
               screen9r1text[9] = 'C';
           } else if(VIENNA_boardStatus == vpv1_overvoltage) {
               screen9r1text[6] = 'O';
               screen9r1text[7] = 'V';
               screen9r1text[8] = 'P';
               screen9r1text[9] = 'V';
           } else if(VIENNA_boardStatus == vpv2_overvoltage) {
               screen9r1text[6] = 'O';
               screen9r1text[7] = 'V';
               screen9r1text[8] = 'P';
               screen9r1text[9] = 'V';
           } else if(VIENNA_boardStatus == boardStatus_OverCurrentTrip_IL1) {
               screen9r1text[6] = 'O';
               screen9r1text[7] = 'C';
               screen9r1text[8] = 'I';
               screen9r1text[9] = '1';
           } else if(VIENNA_boardStatus == boardStatus_OverCurrentTrip_IL2) {
               screen9r1text[6] = 'O';
               screen9r1text[7] = 'C';
               screen9r1text[8] = 'I';
               screen9r1text[9] = '2';
           } else if(VIENNA_boardStatus == boardStatus_NoFault) {
               screen9r1text[6] = 'O';
               screen9r1text[7] = 'K';
               screen9r1text[8] = '.';
               screen9r1text[9] = '.';
           }

           string_LCD = screen9r1text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SCREEN9R2:
           //char screen9r2text[] =      "Fixed it?       ";

           string_LCD = screen9r2text;
           New_string = 1;
           LCD_Ptr = &Array_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;


       case CLEAR_SCREEN:
           command_LCD = 0x01;
           New_command = 1;
           LCD_Ptr = &Command_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case LINE1:
           command_LCD = 0x80;
           New_command = 1;
           LCD_Ptr = &Command_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case LINE2:
           command_LCD = 0xC0;
           New_command = 1;
           LCD_Ptr = &Command_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case CURSOR_ON:
           command_LCD = 0x0F;
           New_command = 1;
           LCD_Ptr = &Command_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case CURSOR_OFF:
           command_LCD = 0x0C;
           New_command = 1;
           LCD_Ptr = &Command_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SHIFT_RIGHT:
           command_LCD = 0x1C;
           New_command = 1;
           LCD_Ptr = &Command_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       case SHIFT_LEFT:
           command_LCD = 0x18;
           New_command = 1;
           LCD_Ptr = &Command_Process;
           LCD_ACTION = LCD_NO_ACTION;
           break;
       default:
           break;
   }
}

