rupeshwandhare/InductionMotor_F28004x/vienna_main.c
/*
//in 1 or 100millisecond subroutine.
{
    //update string for variable values as follows

}
*/
/*
//If above code is in 1millisecond then it can be clubbed with below set of code.

*/

void Command_Process(void)
{
    ENot = SET;
    if (j_LCD<1) {
        char_LCD = command_LCD;
        j_LCD++;
    }
    else {
        j_LCD=0;
        New_command = 0;
        LCD_Ptr = &LCD_selection;
        return;
    }
    RSNot = SET;             // => RS = 0
    LCD_Ptr = &Byte_Process;
}
void Array_Process(void)
{
    ENot = SET;
    if (i_LCD<16) {   //row length = 31
        char_LCD = *(string_LCD+i_LCD);                                    // for(i=0;str[i]!='\0';i++)
        i_LCD++;
    }
    else {
        i_LCD = 0;
        New_string = 0;
        LCD_Ptr = &LCD_selection;
        return;
    }
    RS = SET;             // => RS = 1
    LCD_Ptr = &Byte_Process;
}
void Byte_Process(void)
{
    char y;
    LSNibble = char_LCD&0x0F;
    y = char_LCD&0xF0;
    MSNibble = y>>4;
    LCD_Ptr = &MSNibble_Process;
}
void MSNibble_Process(void)
{
    ENot = SET;
    Lcd_Nibble_Port(MSNibble);             //Data transfer
    LCD_Ptr = &LSNibble_Process;
}
void LSNibble_Process(void)
{
    ENot = SET;
    Lcd_Nibble_Port(LSNibble);
    if (New_string)
        LCD_Ptr = &Array_Process;
    if (New_command)
        LCD_Ptr = &Command_Process;
}
void Lcd_Nibble_Port(unsigned char Value)
{
    if((Value & 0x01) == 0x01)  // CHECK ALTERNATIVE TO THIS LINE. As per LCD example file "if(value & 1) D4=SET;"
        D4 = SET; //GPIO_setHigh(myGpio, D4);
    else
        D4Not = SET;
    if((Value & 0x02) == 0x02)
        D5 = SET; //GPIO_setHigh(myGpio, D5);
    else
        D5Not = SET;
    if((Value & 0x04) == 0x04)
        D6 = SET; //GPIO_setHigh(myGpio, D6);
    else
        D6Not = SET;
    if((Value & 0x08) == 0x08)
        D7 = SET; //GPIO_setHigh(myGpio, D7);
    else
        D7Not = SET;
    E = SET;  //GPIO_setHigh(myGpio, E);            //Set E pin to select LCD
}
void WriteCommandLCD(unsigned char CommandByte) //only for initialization
{
    //RS = CLEAR; // GPIO_setLow(myGpio, RS);        //Clear RS pin to write command
    RSNot = SET;
    Lcd_Nibble_Port(CommandByte);
    LCDDelay();                     //Small delay
    LCDDelay();                     //Small delay
}
/*
void Lcd_Set_Cursor(unsigned char a, unsigned char b)
{
    char temp,z,y;
    if(a == 1)
    {
        temp = 0x80 + b - 1;
        zy = temp;
      //  z = temp>>4;
      //  y = temp & 0x0F;
      //  WriteCommandLCD(z);
      //  WriteCommandLCD(y);
    }
    else if(a == 2)
    {
        temp = 0xC0 + b - 1;
        zy = temp;
      //  z = temp>>4;
      //  y = temp & 0x0F;
      //  WriteCommandLCD(z);
      //  WriteCommandLCD(y);
    }
//I think we can add else if(a==3) and if(a==4) for 4x16 LCD
}
*/


/* Small delay */
void LCDDelay(void)
{
/*
    unsigned int x;
    for(x=50; x<=0; x-- );
*/
    DELAY_US(50);
}

/* Big delay */
void LCDDelay1600(void)
{
/*
    unsigned int x;
    for(x=1600; x<=0; x-- );
*/
    DELAY_US(1600);
}




void remote_operation(void)
{
    if (ECap1Regs.ECCTL2.bit.STOP_WRAP==1) {
        if (ECap1Regs.ECFLG.bit.CEVT2) {
            ISR_remote();
        }
    }
    if (ECap1Regs.ECCTL2.bit.STOP_WRAP==3) {
        if (ECap1Regs.ECFLG.bit.CEVT4) {
            ISR_remote();
        }
    }
}

void remote_key_display_state_machine(void)
{
    if (UpDownKeyFunc==KeyForScreenMov) {
        if (Last_Switch==UP_Key) {
            Last_Switch = 0;
            //Action1
            LEDRed = ON;
            Test3=1;
            Screen_count++;
            if (Screen_count>=8) Screen_count=1;
        }
        else if (Last_Switch==DOWN_Key) {
            Last_Switch = 0;
            //Action2
            LEDRed = ON;
//            LCD_ACTION = LINE2;
            Test3=2;
            Screen_count--;
            if (Screen_count==0) Screen_count=7;

        }
    }
    else if (UpDownKeyFunc==KeyForPasswordConst) {
        if (Last_Switch==UP_Key) {
            Last_Switch = 0;
            //Action1
            LEDRed = ON;

            if (Longpress)
                PasswordConst=PasswordConst+10;
            else
                PasswordConst++;

            Test3=1;
        }
        else if (Last_Switch==DOWN_Key) {
            Last_Switch = 0;
            //Action2
            LEDRed = ON;

            if (Longpress)
                PasswordConst=PasswordConst-10;
            else
                PasswordConst--;

            Test3=2;
        }
    }

    else if (UpDownKeyFunc==KeyForChangeIDofConst) {
        if (Last_Switch==UP_Key) {
            Last_Switch = 0;
            //Action1
            LEDRed = ON;

            if (Longpress)
                ID_Const=ID_Const+5;
            else {
                ID_Const++;
                if (ID_Const >= 99) {
                    Screen_count=1;
                    UpDownKeyFunc=KeyForScreenMov;
                    Command_Const=DISABLE;
                    Command_PwD=OFF;
                    ID_Const = 0;
                    PasswordConst=0;
                }
            }

            Test3=1;
        }
        else if (Last_Switch==DOWN_Key) {
            Last_Switch = 0;
            //Action2
            LEDRed = ON;

            if (Longpress) {
                ID_Const=ID_Const-5;
                if (ID_Const<=0) ID_Const=1;
            }
            else{
                ID_Const--;
                if (ID_Const<=0) ID_Const=1;
            }

            Test3=2;
        }
        pickup_constant();
        Constant=(*Ptr_Constant)*(float)Decimizer[ID_Const];
    }

    else if (UpDownKeyFunc==KeyForChangeofConst) {
        if (Last_Switch==UP_Key) {
            Last_Switch = 0;
            //Action1
            LEDRed = ON;

            if (Longpress)
                Constant=Constant+10;
            else
                Constant++;

            Test3=1;
        }
        else if (Last_Switch==DOWN_Key) {
            Last_Switch = 0;
            //Action2
            LEDRed = ON;

            if (Longpress)
                Constant=Constant-10;
            else
                Constant--;

            Test3=2;
        }

