rupeshwandhare/InductionMotor_F28004x/vienna_main.c
        *Ptr_Constant = Constant/((float)Decimizer[ID_Const]);
        HMI_Change_Constants=1;
    }



    if (Last_Switch==LEFT_Key) {
        Last_Switch = 0;
        //Action3
        LEDRed = ON;
//        LCD_ACTION = SCREEN1R1;
        Test3=3;
    }
    if (Last_Switch==RIGHT_Key) {
        Last_Switch = 0;
        //Action4
        LEDRed = ON;
//        LCD_ACTION = SCREEN1R2;
        Test3=4;
    }
    if (Last_Switch==OnOff_Key) {
        Last_Switch = 0;
        //Action5
        LEDRed = ON;
        if ((command.OnOffCh1)&&(Screen_count==1)) {
            command.OnOffCh1=OFF;
            command_OnOffCh1=OFF;
        }
        else if ((!command.OnOffCh1)&&(Screen_count==1)) {
            command.OnOffCh1=ON;
            command_OnOffCh1=ON;
        }
        else if ((command.OnOffCh2)&&(Screen_count==2)) {
            command.OnOffCh2=OFF;
            command_OnOffCh2=OFF;
        }
        else if ((!command.OnOffCh2)&&(Screen_count==2)) {
            command.OnOffCh2=ON;
            command_OnOffCh2=ON;
        }

        if (Screen_count==9) {
            command.Clear_OCfault  = 1;
            command_Clear_OCfault  = 1;
        }

        if ((Command_PwD)&&(Screen_count==7)) {
            if (PasswordConst==85) {
                Screen_count=8;
                UpDownKeyFunc=KeyForChangeIDofConst;
            } else {
                Screen_count=1;
                UpDownKeyFunc=KeyForScreenMov;
                PasswordConst=0;
            }
            Command_PwD=OFF;
        }
        else if ((!Command_PwD)&&(Screen_count==7)) {
            UpDownKeyFunc=KeyForPasswordConst;
            Command_PwD=ON;
        }

        if ((Command_Const)&&(Screen_count==8)){
            UpDownKeyFunc=KeyForChangeofConst;
            Command_Const=DISABLE;
        } else if ((!Command_Const)&&(Screen_count==8)){
            UpDownKeyFunc=KeyForChangeIDofConst;
            Command_Const=ENABLE;
        }

//        LCD_ACTION = SCREEN1R2;
//        Test3=5;
    }

    if (CONTROL_STATE == FAULT_STATE) {
        if (Screen_count != 9) {
        Screen_count = 9;
        LCD_ACTION = SCREEN9R1;
        }
    }

    if (Last_Switch==MODE_Key) {
        Last_Switch = 0;
        //Action6
//        LCD_ACTION = CLEAR_SCREEN;
        Test3=6;
        //
    }
    Last_Switch = 0;
}

Uint16 Seq_screen=1;
Uint16 Prev_Screen_count=0;
void StateControl_RemoteScreen(void)
{
    if (Prev_Screen_count!=Screen_count) {
        Prev_Screen_count=Screen_count;
        LCD_ACTION = CLEAR_SCREEN;
        Seq_screen=1;
        return;
    }

    switch (Screen_count) {
        case 1:
            switch (Seq_screen){
                case 1:
                    LCD_ACTION = SCREEN1R1;
                    Seq_screen++;
                    break;
                case 2:
                    LCD_ACTION = LINE2;
                    Seq_screen++;
                    break;
                case 3:
                    LCD_ACTION = SCREEN1R2;
                    Seq_screen++;
                    break;
                case 4:
                    LCD_ACTION = LINE1;
                    Seq_screen=1;
                    break;
                default:
                    break;
            }
            break;

        case 2:
            switch (Seq_screen){
                case 1:
                    LCD_ACTION = SCREEN2R1;
                    Seq_screen++;
                    break;
                case 2:
                    LCD_ACTION = LINE2;
                    Seq_screen++;
                    break;
                case 3:
                    LCD_ACTION = SCREEN2R2;
                    Seq_screen++;
                    break;
                case 4:
                    LCD_ACTION = LINE1;
                    Seq_screen=1;
                    break;
                default:
                    break;
            }
            break;

        case 3:
            switch (Seq_screen){
                case 1:
                    LCD_ACTION = SCREEN3R1;
                    Seq_screen++;
                    break;
                case 2:
                    LCD_ACTION = LINE2;
                    Seq_screen++;
                    break;
                case 3:
                    LCD_ACTION = SCREEN3R2;
                    Seq_screen++;
                    break;
                case 4:
                    LCD_ACTION = LINE1;
                    Seq_screen=1;
                    break;
                default:
                    break;
            }
            break;

       case 4:
           switch (Seq_screen){
                case 1:
                    LCD_ACTION = SCREEN4R1;
                    Seq_screen++;
                    break;
                case 2:
                    LCD_ACTION = LINE2;
                    Seq_screen++;
                    break;
                case 3:
                    LCD_ACTION = SCREEN4R2;
                    Seq_screen++;
                    break;
                case 4:
                    LCD_ACTION = LINE1;
                    Seq_screen=1;
                    break;
                default:
                    break;
           }
           break;

       case 5:
           switch (Seq_screen){
               case 1:
                   LCD_ACTION = SCREEN5R1;
                   Seq_screen++;
                   break;
               case 2:
                   LCD_ACTION = LINE2;
                   Seq_screen++;
                   break;
               case 3:
                   LCD_ACTION = SCREEN5R2;
                   Seq_screen++;
                   break;
               case 4:
                   LCD_ACTION = LINE1;
                   Seq_screen=1;
                   break;
               default:
                   break;
           }
           break;

       case 6:
           switch (Seq_screen){
               case 1:
                   LCD_ACTION = SCREEN6R1;
                   Seq_screen++;
                   break;
               case 2:
                   LCD_ACTION = LINE2;
                   Seq_screen++;
                   break;
               case 3:
                   LCD_ACTION = SCREEN6R2;
                   Seq_screen++;
                   break;
               case 4:
                   LCD_ACTION = LINE1;
                   Seq_screen=1;
                   break;
               default:
                   break;
           }
           break;

       case 7:
           switch (Seq_screen){
               case 1:
                   LCD_ACTION = SCREEN7R1;
                   Seq_screen++;
                   break;
               case 2:
                   LCD_ACTION = LINE2;
                   Seq_screen++;
                   break;
               case 3:
                   LCD_ACTION = SCREEN7R2;
                   Seq_screen++;
                   break;
               case 4:
                   LCD_ACTION = LINE1;
                   Seq_screen=1;
                   break;
               default:
                   break;
          }
           break;

       case 8:
           switch (Seq_screen){
               case 1:
                   LCD_ACTION = SCREEN8R1;
                   Seq_screen++;
                   break;
               case 2:
                   LCD_ACTION = LINE2;
                   Seq_screen++;
                   break;
               case 3:
                   LCD_ACTION = SCREEN8R2;
                   Seq_screen++;
                   break;
               case 4:
                   LCD_ACTION = LINE1;
                   Seq_screen=1;
                   break;
               default:
                   break;
           }
           break;


        default:
            break;
    }
}

//For assigning picking up constant to change THERE IS BETTER WAY (SHORT CODE) IF USED STRUCTURE
volatile float32_t dummy;
void pickup_constant(void)
{
    switch(ID_Const){
    case 0:
        Ptr_Constant = &Res_flash_init;
        break;
    case 1:
        Ptr_Constant = &Select_PVcurve1;
        break;
    case 2:
        Ptr_Constant = &Select_PVcurve2;
        break;
    case 3:
        Ptr_Constant = &vpv_ref1;
        break;
    case 4:
        Ptr_Constant = &Temp1;
        break;
    case 5:
        Ptr_Constant = &BetaV1;
        break;
    case 6:
        Ptr_Constant = &Ns1;
        break;
    case 7:
        Ptr_Constant = &Np1;
        break;
    case 8:
        Ptr_Constant = &ILight1;
        break;
    case 9:
        Ptr_Constant = &Np1;
        break;
    case 10:
        Ptr_Constant = &Io1;
        break;
    case 11:
        Ptr_Constant = &Rs1;
        break;
    case 12:
        Ptr_Constant = &vpv_ref2;
        break;
    case 13:
        Ptr_Constant = &Temp2;
        break;
    case 14:
        Ptr_Constant = &BetaV2;
        break;
    case 15:
        Ptr_Constant = &Ns2;
        break;
    case 16:
        Ptr_Constant = &Np2;
        break;
    case 17:
        Ptr_Constant = &ILight2;
        break;
    case 18:
        Ptr_Constant = &reserved;
        break;
    case 19:
        Ptr_Constant = &Np2;
        break;
    case 20:
        Ptr_Constant = &Io2;
        break;
    case 21:
        Ptr_Constant = &Rs2;
        break;
    case 22:
        Ptr_Constant = &update_const_upper_limit_vpv2_controlout;
        break;
    case 23:
        Ptr_Constant = &update_const_lower_limit_vpv2_controlout;
        break;
    case 24:
        Ptr_Constant = &update_const_ipv1_ref_isc;
        break;
    case 25:
        Ptr_Constant = &update_const_vpv1_ref_vsc;
        break;
    case 26:
        Ptr_Constant = &update_const_vpv1_ref_voc;
        break;
    case 27:
        Ptr_Constant = &update_const_ipv1_ref_imp;
        break;
    case 28:
        Ptr_Constant = &update_const_slop1_vpv1_ref_gen;
        break;
    case 29:
        Ptr_Constant = &update_const_constant1_vpv1_ref_gen;
        break;
    case 30:
        Ptr_Constant = &update_const_slop2_vpv1_ref_gen;
        break;
    case 31:
        Ptr_Constant = &update_const_constant2_vpv1_ref_gen;
        break;
    case 32:
        Ptr_Constant = &update_const_ipv2_ref_isc;
        break;
    case 33:
        Ptr_Constant = &update_const_vpv2_ref_vsc;
        break;
    case 34:
        Ptr_Constant = &update_const_vpv2_ref_voc;
        break;
    case 35:
        Ptr_Constant = &update_const_ipv2_ref_imp;
        break;
    case 36:
        Ptr_Constant = &update_const_slop1_vpv2_ref_gen;
        break;
    case 37:
        Ptr_Constant = &update_const_constant1_vpv2_ref_gen;
        break;
    case 38:
        Ptr_Constant = &update_const_slop2_vpv2_ref_gen;
        break;
    case 39:
        Ptr_Constant = &update_const_constant2_vpv2_ref_gen;
        break;
    case 40:
        Ptr_Constant = &update_const_slew_rate1;
        break;
    case 41:
        Ptr_Constant = &update_const_vpv1_threshold_slew_to_vpvcontrol;
        break;
    case 42:
        Ptr_Constant = &update_const_duty1_threshold_slew_to_vpvcontrol;
        break;
    case 43:
        Ptr_Constant = &update_const_slew_rate2;
        break;
    case 44:
        Ptr_Constant = &update_const_vpv2_threshold_slew_to_vpvcontrol;
        break;
    case 45:
        Ptr_Constant = &update_const_duty2_threshold_slew_to_vpvcontrol;
        break;
    case 46:
        Ptr_Constant = &update_const_vdc_threshold_charging_to_idle;
        break;
    case 47:
        Ptr_Constant = &update_const_deacceleration_rate;
        break;
    case 48:
        Ptr_Constant = &update_const_upper_duty_threshold;
        break;
    case 49:
        Ptr_Constant = &update_const_k1_PIiL1;
        break;
    case 50:
        Ptr_Constant = &update_const_k2_PIiL1;
        break;
    case 51:
        Ptr_Constant = &update_const_k1_PIiL2;
        break;
    case 52:
        Ptr_Constant = &update_const_k2_PIiL2;
        break;
    case 53:
        Ptr_Constant = &update_const_upper_limit_il1_PIout;
        break;
    case 54:
        Ptr_Constant = &update_const_lower_limit_il1_PIout;
        break;
    case 55:
        Ptr_Constant = &update_const_upper_limit_il2_PIout;
        break;
    case 56:
        Ptr_Constant = &update_const_lower_limit_il2_PIout;
        break;
    case 57:
        Ptr_Constant = &update_const_upper_limit_il1_controlout;
        break;
    case 58:
        Ptr_Constant = &update_const_lower_limit_il1_controlout;
        break;
    case 59:
        Ptr_Constant = &update_const_upper_limit_il2_controlout;
        break;
    case 60:
        Ptr_Constant = &update_const_lower_limit_il2_controlout;
        break;
    case 61:
        Ptr_Constant = &update_const_k1_PIvpv1;
        break;
    case 62:
        Ptr_Constant = &update_const_k2_PIvpv1;
        break;
    case 63:
        Ptr_Constant = &update_const_k1_PIvpv2;
        break;
    case 64:
        Ptr_Constant = &update_const_k2_PIvpv2;
        break;
    case 65:
        Ptr_Constant = &update_const_upper_limit_vpv1_PIout;
        break;
    case 66:
        Ptr_Constant = &update_const_lower_limit_vpv1_PIout;
        break;
    case 67:
        Ptr_Constant = &update_const_upper_limit_vpv2_PIout;
        break;
    case 68:
        Ptr_Constant = &update_const_lower_limit_vpv2_PIout;
        break;
    case 69:
        Ptr_Constant = &update_const_upper_limit_vpv1_controlout;
        break;
    case 70:
        Ptr_Constant = &update_const_lower_limit_vpv1_controlout;
        break;
    case 71:
        Ptr_Constant = &k1_Fltr_vpv1n2;
        break;
    case 72:
        Ptr_Constant = &k2_Fltr_vpv1n2;
        break;
    case 73:
        Ptr_Constant = &Load_Default_Constants;
        break;
    default:
        Ptr_Constant = &dummy;
        break;
    }
}

//
void load_flash_constants(void)
{
//    Ptr_flash_constants = (uint32 *)Bzero_Sector6_start; //(uint16*)0x86000;
    Ptr_flash_constants = (float32_t *)Bzero_Sector6_start; //(uint16*)0x86000;
    ID_Const=0;
    for(idx = 0; idx < (NosOfConst+1); idx++)
    {
        pickup_constant();
        *Ptr_Constant = *Ptr_flash_constants;  //Constants_Default[idx]
        ID_Const++;
        Ptr_flash_constants++;
    }
}

