rupeshwandhare/InductionMotor_F28004x/vienna_main.c
// InitECapture - Initialize ECAP1 configurations
void InitECapture()
{
    EALLOW;

    ECap1Regs.ECEINT.all = 0x0000;          // Disable all capture __interrupts
    ECap1Regs.ECCLR.all = 0xFFFF;           // Clear all CAP __interrupt flags

    ECap1Regs.ECCTL1.bit.CAPLDEN = 0;       // Disable CAP1-CAP4 register loads
    ECap1Regs.ECCTL2.bit.TSCTRSTOP = 0;     // Make sure the counter is stopped
    ECap1Regs.ECCTL2.bit.CAP_APWM = 0;      //EC_CAP_MODE=0
    ECap1Regs.ECCTL2.bit.CONT_ONESHT = 0;   // Countinous
    ECap1Regs.ECCTL2.bit.STOP_WRAP = 1;     // It should be 1 in IR sensor as we want to measure 9+4.5msec,0.56+0.56,0.56+2*0.56 (down-up)
   ECap1Regs.ECCTL1.bit.CAP1POL = 1;       // Falling edge, yes in IR we need
   ECap1Regs.ECCTL1.bit.CAP2POL = 1;       // fall  edge, yes in IR we need
   ECap1Regs.ECCTL1.bit.CAP3POL = 1;       // Falling edge, not required
   ECap1Regs.ECCTL1.bit.CAP4POL = 1;       // falling edge, not required
   ECap1Regs.ECCTL1.bit.CTRRST1 = 1;       // Difference operation, yes we should reset it
   ECap1Regs.ECCTL1.bit.CTRRST2 = 1;       // Difference operation, yes we should reset it
   ECap1Regs.ECCTL1.bit.CTRRST3 = 1;       // Difference operation
   ECap1Regs.ECCTL1.bit.CTRRST4 = 1;       // Difference operation

   ECap1Regs.ECCTL0.bit.INPUTSEL = 6; //connect ECap1 to INPUT7SELECT  //****THERE WAS PROBLEM HERE***//
//   ECap1Regs.ECCTL0.bit.INPUTSEL = 5; //connect ECap1 to INPUT6SELECT  //****THERE WAS PROBLEM HERE***//
//   ECAP_selectECAPInput(ECAP1_BASE, ECAP_INPUT_INPUTXBAR7);  //This statement assign ECCTL0.bit.INPUTSEL = 6.


   ECap1Regs.ECCTL2.bit.SYNCI_EN = 1;      // Enable sync in
   ECap1Regs.ECCTL2.bit.SYNCO_SEL = 0;     // Pass through
   ECap1Regs.ECCTL2.bit.TSCTRSTOP = 1;     // Start Counter   //****PROBLEM WITH THIS STATEMENT****//
/*   ECap1Regs.ECCTL1.bit.CAPLDEN = 1;       // Enable capture units
   ECap1Regs.ECCTL2.bit.REARM = 1;         // arm one-shot
*/

//   ECAP_enableLoadCounter(ECAP1_BASE); // ECAP_O_ECCTL2, ECAP_ECCTL2_SYNCI_EN;
//   ECAP_setSyncOutMode(ECAP1_BASE, ECAP_SYNC_OUT_SYNCI);  //ECAP_O_ECCTL2 , ECAP_SYNC_OUT_SYNCI pass through
   ECAP_startCounter(ECAP1_BASE); //ECAP_ECCTL2_TSCTRSTOP
   ECAP_enableTimeStampCapture(ECAP1_BASE); //ECAP_ECCTL1_CAPLDEN;
   ECAP_reArm(ECAP1_BASE); //ECAP_ECCTL2_REARM;

//   ECap1Regs.ECCTL1.bit.CAPLDEN = 1;       // Enable CAP1-CAP4 register loads
//   ECap1Regs.ECEINT.bit.CEVT4 = 1;         // 4 events = __interrupt

//>>> USE THIS LINE IF USING INTERRUPT DRIVEN REMOTE CONTROL OPERATION   ECAP_enableInterrupt(ECAP1_BASE, ECAP_ISR_SOURCE_CAPTURE_EVENT_2);  //at second event CAP4

   EDIS;

}

//
// ecap1_isr - ECAP1 ISR
//              Cap input is syc'ed to SYSCLKOUT so there may be
//              a +/- 1 cycle variation
//

//__interrupt void ecap1_isr(void)
void ISR_remote(void)
{

    if(flag_start_remote) {
        packet_remote++;
        if(ECap1Regs.CAP1 > 82000) {     //111900
            if(ECap1Regs.CAP1 < 162000) {  //for 1.12ms 112000
                Switch=Switch<<1;
            }
            else {  //for 2.25ms 225000
                Switch=Switch<<1;
                Switch|=0x01;
            }
        }
        if(ECap1Regs.CAP2 > 82000) {
            if(ECap1Regs.CAP2 < 162000) {
                Switch=Switch<<1;
            }
            else {
                Switch=Switch<<1;
                Switch|=0x01;
            }
        }
        if(ECap1Regs.CAP3 > 82000) {
            if(ECap1Regs.CAP3 < 162000) {
                Switch=Switch<<1;
            }
            else {
                Switch=Switch<<1;
                Switch|=0x01;
            }
        }
        if(ECap1Regs.CAP4 > 82000) {
            if(ECap1Regs.CAP4 < 162000) {
                Switch=Switch<<1;
            }
            else {
                Switch=Switch<<1;
                Switch|=0x01;
            }
        }
        if(packet_remote>=8) {
            Last_Switch = Switch;
            Prev_Switch = Switch;
            Switch = 0;
            packet_remote = 0;
            flag_start_remote = 0;
            ECAP_clearInterrupt(ECAP1_BASE,ECAP_ISR_SOURCE_CAPTURE_EVENT_4);
            EALLOW;
            ECap1Regs.ECCTL2.bit.STOP_WRAP = 1;     //prepare for 1 cycle check
            ECAP_disableInterrupt(ECAP1_BASE, ECAP_ISR_SOURCE_CAPTURE_EVENT_4);
            //>>> USE THIS LINE IF USING INTERRUPT DRIVEN REMOTE CONTROL OPERATION            ECAP_enableInterrupt(ECAP1_BASE, ECAP_ISR_SOURCE_CAPTURE_EVENT_2); //interrupt on 1 cycle
            EDIS;
        }
    }
    else {
        if(ECap1Regs.CAP2 < 1400000 && ECap1Regs.CAP2 > 1240000 )  {  // for 13.5 ms 1350000
            flag_start_remote = 1;
            packet_remote = 0;
            Longpress=DISABLE;
            ECAP_clearInterrupt(ECAP1_BASE,ECAP_ISR_SOURCE_CAPTURE_EVENT_2);
            EALLOW;
            ECap1Regs.ECCTL2.bit.STOP_WRAP = 3;     //prepare for 4 cycle check
            EDIS;
            ECAP_reArm(ECAP1_BASE);
            EALLOW;
            ECAP_disableInterrupt(ECAP1_BASE, ECAP_ISR_SOURCE_CAPTURE_EVENT_2);
            //>>> USE THIS LINE IF USING INTERRUPT DRIVEN REMOTE CONTROL OPERATION            ECAP_enableInterrupt(ECAP1_BASE, ECAP_ISR_SOURCE_CAPTURE_EVENT_4); //interrupt on 4 cycle
            EDIS;
        }
        if(ECap1Regs.CAP2 < 1230000 && ECap1Regs.CAP2 > 1000000 )  {  // for 11.25 ms 1125000
            Last_Switch = Prev_Switch;
            Longpress=ENABLE;
        }
    }




   ECap1IntCount++;
   ECap1PassCount++;

/*
   ECap1Regs.ECCLR.bit.CEVT4 = 1;
   ECap1Regs.ECCLR.bit.INT = 1;
   ECap1Regs.ECCTL2.bit.REARM = 1;

   //
   // Acknowledge this __interrupt to receive more __interrupts from group 4
   //
   PieCtrlRegs.PIEACK.all = PIEACK_GROUP4;
*/

   //
   // Clear interrupt flags for more interrupts.
   //
   ECAP_clearInterrupt(ECAP1_BASE,ECAP_ISR_SOURCE_CAPTURE_EVENT_2);
   ECAP_clearInterrupt(ECAP1_BASE,ECAP_ISR_SOURCE_CAPTURE_EVENT_4);

   ECAP_clearGlobalInterrupt(ECAP1_BASE);

   //
   // Start eCAP
   //
   ECAP_reArm(ECAP1_BASE);

   //
   // Acknowledge the group interrupt for more interrupts.
   //
   Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP4);

/****** THE PROBLEM IS WITH ACKNOWLEDGING INTERRUPT OR RESETING INTERRUPT *****/ //?????

